Revit 2027 API
ConfigurationReloadInfo.GetOutOfDatePartStatus Method
 Access reload information for out of date part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ReloadSwapOutInfo GetOutOfDatePartStatus(
	int index
)
Public Function GetOutOfDatePartStatus (
	index As Integer
) As ReloadSwapOutInfo
public:
ReloadSwapOutInfo^ GetOutOfDatePartStatus(
	int index
)
member GetOutOfDatePartStatus :
        index : int -> ReloadSwapOutInfo
Parameters
index Int32
 The index of the information about the part being reloaded. Must be between 0 and OutOfDatePartCount.
Return Value
ReloadSwapOutInfo
 Information about the part being reloaded.
Exceptions
Exception | Condition
ArgumentException |  The index is out of range.
See Also
Reference
ConfigurationReloadInfo Class
Autodesk.Revit.DB Namespace